ISouthRain/HC32F448-template/.pack/HDSC/HC32F448.1.0.1/Device/Include/HC32F448MCTI.h
/*  Bit definition for MCAN_ILS register  */
#define MCAN_ILS_RF0NL_POS                             (0U)
#define MCAN_ILS_RF0NL                                 (0x00000001UL)
#define MCAN_ILS_RF0WL_POS                             (1U)
#define MCAN_ILS_RF0WL                                 (0x00000002UL)
#define MCAN_ILS_RF0FL_POS                             (2U)
#define MCAN_ILS_RF0FL                                 (0x00000004UL)
#define MCAN_ILS_RF0LL_POS                             (3U)
#define MCAN_ILS_RF0LL                                 (0x00000008UL)
#define MCAN_ILS_RF1NL_POS                             (4U)
#define MCAN_ILS_RF1NL                                 (0x00000010UL)
#define MCAN_ILS_RF1WL_POS                             (5U)
#define MCAN_ILS_RF1WL                                 (0x00000020UL)
#define MCAN_ILS_RF1FL_POS                             (6U)
#define MCAN_ILS_RF1FL                                 (0x00000040UL)
#define MCAN_ILS_RF1LL_POS                             (7U)
#define MCAN_ILS_RF1LL                                 (0x00000080UL)
#define MCAN_ILS_HPML_POS                              (8U)
#define MCAN_ILS_HPML                                  (0x00000100UL)
#define MCAN_ILS_TCL_POS                               (9U)
#define MCAN_ILS_TCL                                   (0x00000200UL)
#define MCAN_ILS_TCFL_POS                              (10U)
#define MCAN_ILS_TCFL                                  (0x00000400UL)
#define MCAN_ILS_TFEL_POS                              (11U)
#define MCAN_ILS_TFEL                                  (0x00000800UL)
#define MCAN_ILS_TEFNL_POS                             (12U)
#define MCAN_ILS_TEFNL                                 (0x00001000UL)
#define MCAN_ILS_TEFWL_POS                             (13U)
#define MCAN_ILS_TEFWL                                 (0x00002000UL)
#define MCAN_ILS_TEFFL_POS                             (14U)
#define MCAN_ILS_TEFFL                                 (0x00004000UL)
#define MCAN_ILS_TEFLL_POS                             (15U)
#define MCAN_ILS_TEFLL                                 (0x00008000UL)
#define MCAN_ILS_TSWL_POS                              (16U)
#define MCAN_ILS_TSWL                                  (0x00010000UL)
#define MCAN_ILS_MRAFL_POS                             (17U)
#define MCAN_ILS_MRAFL                                 (0x00020000UL)
#define MCAN_ILS_TOOL_POS                              (18U)
#define MCAN_ILS_TOOL                                  (0x00040000UL)
#define MCAN_ILS_DRXL_POS                              (19U)
#define MCAN_ILS_DRXL                                  (0x00080000UL)
#define MCAN_ILS_BECL_POS                              (20U)
#define MCAN_ILS_BECL                                  (0x00100000UL)
#define MCAN_ILS_BEUL_POS                              (21U)
#define MCAN_ILS_BEUL                                  (0x00200000UL)
#define MCAN_ILS_ELOL_POS                              (22U)
#define MCAN_ILS_ELOL                                  (0x00400000UL)
#define MCAN_ILS_EPL_POS                               (23U)
#define MCAN_ILS_EPL                                   (0x00800000UL)
#define MCAN_ILS_EWL_POS                               (24U)
#define MCAN_ILS_EWL                                   (0x01000000UL)
#define MCAN_ILS_BOL_POS                               (25U)
#define MCAN_ILS_BOL                                   (0x02000000UL)
#define MCAN_ILS_WDIL_POS                              (26U)
#define MCAN_ILS_WDIL                                  (0x04000000UL)
#define MCAN_ILS_PEAL_POS                              (27U)
#define MCAN_ILS_PEAL                                  (0x08000000UL)
#define MCAN_ILS_PEDL_POS                              (28U)
#define MCAN_ILS_PEDL                                  (0x10000000UL)
#define MCAN_ILS_ARAL_POS                              (29U)
#define MCAN_ILS_ARAL                                  (0x20000000UL)

/*  Bit definition for MCAN_ILE register  */
#define MCAN_ILE_EINT0_POS                             (0U)
#define MCAN_ILE_EINT0                                 (0x00000001UL)
#define MCAN_ILE_EINT1_POS                             (1U)
#define MCAN_ILE_EINT1                                 (0x00000002UL)

/*  Bit definition for MCAN_GFC register  */
#define MCAN_GFC_RRFE_POS                              (0U)
#define MCAN_GFC_RRFE                                  (0x00000001UL)
#define MCAN_GFC_RRFS_POS                              (1U)
#define MCAN_GFC_RRFS                                  (0x00000002UL)
#define MCAN_GFC_ANFE_POS                              (2U)
#define MCAN_GFC_ANFE                                  (0x0000000CUL)
#define MCAN_GFC_ANFE_0                                (0x00000004UL)
#define MCAN_GFC_ANFE_1                                (0x00000008UL)
#define MCAN_GFC_ANFS_POS                              (4U)
#define MCAN_GFC_ANFS                                  (0x00000030UL)
#define MCAN_GFC_ANFS_0                                (0x00000010UL)
#define MCAN_GFC_ANFS_1                                (0x00000020UL)

/*  Bit definition for MCAN_SIDFC register  */
#define MCAN_SIDFC_FLSSA_POS                           (2U)
#define MCAN_SIDFC_FLSSA                               (0x0000FFFCUL)
#define MCAN_SIDFC_LSS_POS                             (16U)
#define MCAN_SIDFC_LSS                                 (0x00FF0000UL)

/*  Bit definition for MCAN_XIDFC register  */
#define MCAN_XIDFC_FLESA_POS                           (2U)
#define MCAN_XIDFC_FLESA                               (0x0000FFFCUL)
#define MCAN_XIDFC_LSE_POS                             (16U)
#define MCAN_XIDFC_LSE                                 (0x007F0000UL)

/*  Bit definition for MCAN_XIDAM register  */
#define MCAN_XIDAM_EIDM                                (0x1FFFFFFFUL)

/*  Bit definition for MCAN_HPMS register  */
#define MCAN_HPMS_BIDX_POS                             (0U)
#define MCAN_HPMS_BIDX                                 (0x0000003FUL)
#define MCAN_HPMS_MSI_POS                              (6U)
#define MCAN_HPMS_MSI                                  (0x000000C0UL)
#define MCAN_HPMS_MSI_0                                (0x00000040UL)
#define MCAN_HPMS_MSI_1                                (0x00000080UL)
#define MCAN_HPMS_FIDX_POS                             (8U)
#define MCAN_HPMS_FIDX                                 (0x00007F00UL)
#define MCAN_HPMS_FLST_POS                             (15U)
#define MCAN_HPMS_FLST                                 (0x00008000UL)

/*  Bit definition for MCAN_NDAT1 register  */
#define MCAN_NDAT1_ND0_POS                             (0U)
#define MCAN_NDAT1_ND0                                 (0x00000001UL)
#define MCAN_NDAT1_ND1_POS                             (1U)
#define MCAN_NDAT1_ND1                                 (0x00000002UL)
#define MCAN_NDAT1_ND2_POS                             (2U)
#define MCAN_NDAT1_ND2                                 (0x00000004UL)
#define MCAN_NDAT1_ND3_POS                             (3U)
#define MCAN_NDAT1_ND3                                 (0x00000008UL)
#define MCAN_NDAT1_ND4_POS                             (4U)
#define MCAN_NDAT1_ND4                                 (0x00000010UL)
#define MCAN_NDAT1_ND5_POS                             (5U)
#define MCAN_NDAT1_ND5                                 (0x00000020UL)
#define MCAN_NDAT1_ND6_POS                             (6U)
#define MCAN_NDAT1_ND6                                 (0x00000040UL)
#define MCAN_NDAT1_ND7_POS                             (7U)
#define MCAN_NDAT1_ND7                                 (0x00000080UL)
#define MCAN_NDAT1_ND8_POS                             (8U)
#define MCAN_NDAT1_ND8                                 (0x00000100UL)
#define MCAN_NDAT1_ND9_POS                             (9U)
#define MCAN_NDAT1_ND9                                 (0x00000200UL)
#define MCAN_NDAT1_ND10_POS                            (10U)
#define MCAN_NDAT1_ND10                                (0x00000400UL)
#define MCAN_NDAT1_ND11_POS                            (11U)
#define MCAN_NDAT1_ND11                                (0x00000800UL)
#define MCAN_NDAT1_ND12_POS                            (12U)
#define MCAN_NDAT1_ND12                                (0x00001000UL)
#define MCAN_NDAT1_ND13_POS                            (13U)
#define MCAN_NDAT1_ND13                                (0x00002000UL)
#define MCAN_NDAT1_ND14_POS                            (14U)
#define MCAN_NDAT1_ND14                                (0x00004000UL)
#define MCAN_NDAT1_ND15_POS                            (15U)
#define MCAN_NDAT1_ND15                                (0x00008000UL)
#define MCAN_NDAT1_ND16_POS                            (16U)
#define MCAN_NDAT1_ND16                                (0x00010000UL)
#define MCAN_NDAT1_ND17_POS                            (17U)
#define MCAN_NDAT1_ND17                                (0x00020000UL)
#define MCAN_NDAT1_ND18_POS                            (18U)
#define MCAN_NDAT1_ND18                                (0x00040000UL)
#define MCAN_NDAT1_ND19_POS                            (19U)
#define MCAN_NDAT1_ND19                                (0x00080000UL)
#define MCAN_NDAT1_ND20_POS                            (20U)
#define MCAN_NDAT1_ND20                                (0x00100000UL)
#define MCAN_NDAT1_ND21_POS                            (21U)
#define MCAN_NDAT1_ND21                                (0x00200000UL)
#define MCAN_NDAT1_ND22_POS                            (22U)
#define MCAN_NDAT1_ND22                                (0x00400000UL)
#define MCAN_NDAT1_ND23_POS                            (23U)
#define MCAN_NDAT1_ND23                                (0x00800000UL)
#define MCAN_NDAT1_ND24_POS                            (24U)
#define MCAN_NDAT1_ND24                                (0x01000000UL)
#define MCAN_NDAT1_ND25_POS                            (25U)
#define MCAN_NDAT1_ND25                                (0x02000000UL)
#define MCAN_NDAT1_ND26_POS                            (26U)
#define MCAN_NDAT1_ND26                                (0x04000000UL)
#define MCAN_NDAT1_ND27_POS                            (27U)
#define MCAN_NDAT1_ND27                                (0x08000000UL)
#define MCAN_NDAT1_ND28_POS                            (28U)
#define MCAN_NDAT1_ND28                                (0x10000000UL)
#define MCAN_NDAT1_ND29_POS                            (29U)
#define MCAN_NDAT1_ND29                                (0x20000000UL)
#define MCAN_NDAT1_ND30_POS                            (30U)
#define MCAN_NDAT1_ND30                                (0x40000000UL)
#define MCAN_NDAT1_ND31_POS                            (31U)
#define MCAN_NDAT1_ND31                                (0x80000000UL)

/*  Bit definition for MCAN_NDAT2 register  */
#define MCAN_NDAT2_ND32_POS                            (0U)
#define MCAN_NDAT2_ND32                                (0x00000001UL)
#define MCAN_NDAT2_ND33_POS                            (1U)
#define MCAN_NDAT2_ND33                                (0x00000002UL)
#define MCAN_NDAT2_ND34_POS                            (2U)
#define MCAN_NDAT2_ND34                                (0x00000004UL)
#define MCAN_NDAT2_ND35_POS                            (3U)
#define MCAN_NDAT2_ND35                                (0x00000008UL)
#define MCAN_NDAT2_ND36_POS                            (4U)
#define MCAN_NDAT2_ND36                                (0x00000010UL)
#define MCAN_NDAT2_ND37_POS                            (5U)
#define MCAN_NDAT2_ND37                                (0x00000020UL)
#define MCAN_NDAT2_ND38_POS                            (6U)
#define MCAN_NDAT2_ND38                                (0x00000040UL)
#define MCAN_NDAT2_ND39_POS                            (7U)
#define MCAN_NDAT2_ND39                                (0x00000080UL)
#define MCAN_NDAT2_ND40_POS                            (8U)
#define MCAN_NDAT2_ND40                                (0x00000100UL)
#define MCAN_NDAT2_ND41_POS                            (9U)
#define MCAN_NDAT2_ND41                                (0x00000200UL)
#define MCAN_NDAT2_ND42_POS                            (10U)
#define MCAN_NDAT2_ND42                                (0x00000400UL)
#define MCAN_NDAT2_ND43_POS                            (11U)
#define MCAN_NDAT2_ND43                                (0x00000800UL)
#define MCAN_NDAT2_ND44_POS                            (12U)
#define MCAN_NDAT2_ND44                                (0x00001000UL)
#define MCAN_NDAT2_ND45_POS                            (13U)
#define MCAN_NDAT2_ND45                                (0x00002000UL)
#define MCAN_NDAT2_ND46_POS                            (14U)
#define MCAN_NDAT2_ND46                                (0x00004000UL)
#define MCAN_NDAT2_ND47_POS                            (15U)
#define MCAN_NDAT2_ND47                                (0x00008000UL)
#define MCAN_NDAT2_ND48_POS                            (16U)
#define MCAN_NDAT2_ND48                                (0x00010000UL)
#define MCAN_NDAT2_ND49_POS                            (17U)
#define MCAN_NDAT2_ND49                                (0x00020000UL)
#define MCAN_NDAT2_ND50_POS                            (18U)
#define MCAN_NDAT2_ND50                                (0x00040000UL)
#define MCAN_NDAT2_ND51_POS                            (19U)
#define MCAN_NDAT2_ND51                                (0x00080000UL)
#define MCAN_NDAT2_ND52_POS                            (20U)
#define MCAN_NDAT2_ND52                                (0x00100000UL)
#define MCAN_NDAT2_ND53_POS                            (21U)
#define MCAN_NDAT2_ND53                                (0x00200000UL)
#define MCAN_NDAT2_ND54_POS                            (22U)
#define MCAN_NDAT2_ND54                                (0x00400000UL)
#define MCAN_NDAT2_ND55_POS                            (23U)
#define MCAN_NDAT2_ND55                                (0x00800000UL)
#define MCAN_NDAT2_ND56_POS                            (24U)
#define MCAN_NDAT2_ND56                                (0x01000000UL)
#define MCAN_NDAT2_ND57_POS                            (25U)
#define MCAN_NDAT2_ND57                                (0x02000000UL)
#define MCAN_NDAT2_ND58_POS                            (26U)
#define MCAN_NDAT2_ND58                                (0x04000000UL)
#define MCAN_NDAT2_ND59_POS                            (27U)
#define MCAN_NDAT2_ND59                                (0x08000000UL)
#define MCAN_NDAT2_ND60_POS                            (28U)
#define MCAN_NDAT2_ND60                                (0x10000000UL)
#define MCAN_NDAT2_ND61_POS                            (29U)
#define MCAN_NDAT2_ND61                                (0x20000000UL)
#define MCAN_NDAT2_ND62_POS                            (30U)
#define MCAN_NDAT2_ND62                                (0x40000000UL)
#define MCAN_NDAT2_ND63_POS                            (31U)
#define MCAN_NDAT2_ND63                                (0x80000000UL)

/*  Bit definition for MCAN_RXF0C register  */
#define MCAN_RXF0C_F0SA_POS                            (2U)
#define MCAN_RXF0C_F0SA                                (0x0000FFFCUL)
#define MCAN_RXF0C_F0S_POS                             (16U)
#define MCAN_RXF0C_F0S                                 (0x007F0000UL)
#define MCAN_RXF0C_F0WM_POS                            (24U)
#define MCAN_RXF0C_F0WM                                (0x7F000000UL)
#define MCAN_RXF0C_F0OM_POS                            (31U)
#define MCAN_RXF0C_F0OM                                (0x80000000UL)

/*  Bit definition for MCAN_RXF0S register  */
#define MCAN_RXF0S_F0FL_POS                            (0U)
#define MCAN_RXF0S_F0FL                                (0x0000007FUL)
#define MCAN_RXF0S_F0GI_POS                            (8U)
#define MCAN_RXF0S_F0GI                                (0x00003F00UL)
#define MCAN_RXF0S_F0PI_POS                            (16U)
#define MCAN_RXF0S_F0PI                                (0x003F0000UL)
#define MCAN_RXF0S_F0F_POS                             (24U)
#define MCAN_RXF0S_F0F                                 (0x01000000UL)
#define MCAN_RXF0S_RF0L_POS                            (25U)
#define MCAN_RXF0S_RF0L                                (0x02000000UL)

